Microchip-MPLAB-Harmony/csp/arch/arm/config/devices_cortex_m7/PIC32CZ2038CA70144.atdf
          </instance>
        </module>
        <module name="DACC" id="11246" version="E">
          <instance name="DACC">
            <register-group address-space="base" name="DACC" name-in-module="DACC" offset="0x40040000"/>
            <signals>
              <signal pad="PB13" function="X1" group="DAC" index="0"/>
              <signal pad="PD0" function="X1" group="DAC" index="1"/>
              <signal pad="PA2" function="C" group="DATRG"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX" value="30"/>
              <param name="INSTANCE_ID" value="30"/>
              <param name="CLOCK_ID" value="30"/>
            </parameters>
          </instance>
        </module>
        <module name="EFC" id="6450" version="Y">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0C00"/>
            <parameters>
              <param name="FLASH_SIZE" value="2097152"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="INSTANCE_ID" value="6"/>
              <param name="PAGES_PR_REGION" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="GMAC" id="11046" version="S">
          <instance name="GMAC">
            <register-group address-space="base" name="GMAC" name-in-module="GMAC" offset="0x40050000"/>
            <signals>
              <signal pad="PD13" function="A" group="GCOL"/>
              <signal pad="PD10" function="A" group="GCRS"/>
              <signal pad="PD8" function="A" group="GMDC"/>
              <signal pad="PD9" function="A" group="GMDIO"/>
              <signal pad="PD14" function="A" group="GRXCK"/>
              <signal pad="PD4" function="A" group="GRXDV"/>
              <signal pad="PD7" function="A" group="GRXER"/>
              <signal pad="PD5" function="A" group="GRX" index="0"/>
              <signal pad="PD6" function="A" group="GRX" index="1"/>
              <signal pad="PD11" function="A" group="GRX" index="2"/>
              <signal pad="PD12" function="A" group="GRX" index="3"/>
              <signal pad="PB1" function="B" group="GTSUCOMP"/>
              <signal pad="PB12" function="B" group="GTSUCOMP"/>
              <signal pad="PD11" function="C" group="GTSUCOMP"/>
              <signal pad="PD20" function="C" group="GTSUCOMP"/>
              <signal pad="PD0" function="A" group="GTXCK"/>
              <signal pad="PD1" function="A" group="GTXEN"/>
              <signal pad="PD17" function="A" group="GTXER"/>
              <signal pad="PD2" function="A" group="GTX" index="0"/>
              <signal pad="PD3" function="A" group="GTX" index="1"/>
              <signal pad="PD15" function="A" group="GTX" index="2"/>
              <signal pad="PD16" function="A" group="GTX" index="3"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="39"/>
              <param name="CLOCK_ID" value="39"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" id="6378" version="J">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1890"/>
          </instance>
        </module>
        <module name="HSMCI" id="6449" version="R">
          <instance name="HSMCI">
            <register-group address-space="base" name="HSMCI" name-in-module="HSMCI" offset="0x40000000"/>
            <signals>
              <signal pad="PA28" function="C" group="MCCDA"/>
              <signal pad="PA25" function="D" group="MCCK"/>
              <signal pad="PA30" function="C" group="MCDA" index="0"/>
              <signal pad="PA31" function="C" group="MCDA" index="1"/>
              <signal pad="PA26" function="C" group="MCDA" index="2"/>
              <signal pad="PA27" function="C" group="MCDA" index="3"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_RX" value="0"/>
              <param name="DMAC_ID_TX" value="0"/>
              <param name="INSTANCE_ID" value="18"/>
              <param name="CLOCK_ID" value="18"/>
            </parameters>
          </instance>
        </module>
        <module name="I2SC" id="11241" version="N">
          <instance name="I2SC0">
            <register-group address-space="base" name="I2SC0" name-in-module="I2SC" offset="0x4008C000"/>
            <signals>
              <signal pad="PA1" function="D" group="I2SC0_CK"/>
              <signal pad="PA16" function="D" group="I2SC0_DI"/>
              <signal pad="PA30" function="D" group="I2SC0_DO"/>
              <signal pad="PA0" function="D" group="I2SC0_MCK"/>
              <signal pad="PA15" function="D" group="I2SC0_WS"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="69"/>
              <param name="CLOCK_ID" value="69"/>
            </parameters>
          </instance>
          <instance name="I2SC1">
            <register-group address-space="base" name="I2SC1" name-in-module="I2SC" offset="0x40090000"/>
            <signals>
              <signal pad="PA20" function="D" group="I2SC1_CK"/>
              <signal pad="PE2" function="C" group="I2SC1_DI"/>
              <signal pad="PE1" function="C" group="I2SC1_DO"/>
              <signal pad="PA19" function="D" group="I2SC1_MCK"/>
              <signal pad="PE0" function="C" group="I2SC1_WS"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="70"/>
              <param name="CLOCK_ID" value="70"/>
            </parameters>
          </instance>
        </module>
        <module name="ICM" id="11105" version="H">
          <instance name="ICM">
            <register-group address-space="base" name="ICM" name-in-module="ICM" offset="0x40048000"/>
            <parameters>
              <param name="INSTANCE_ID" value="32"/>
              <param name="CLOCK_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="ISI" id="6350" version="K">
          <instance name="ISI">
            <register-group address-space="base" name="ISI" name-in-module="ISI" offset="0x4004C000"/>
            <signals>
              <signal pad="PD22" function="D" group="ISI_D" index="0"/>
              <signal pad="PD21" function="D" group="ISI_D" index="1"/>
              <signal pad="PB3" function="D" group="ISI_D" index="2"/>
              <signal pad="PA9" function="B" group="ISI_D" index="3"/>
              <signal pad="PA5" function="B" group="ISI_D" index="4"/>
              <signal pad="PD11" function="D" group="ISI_D" index="5"/>
              <signal pad="PD12" function="D" group="ISI_D" index="6"/>
              <signal pad="PA27" function="D" group="ISI_D" index="7"/>
              <signal pad="PD27" function="D" group="ISI_D" index="8"/>
              <signal pad="PD28" function="D" group="ISI_D" index="9"/>
              <signal pad="PD30" function="D" group="ISI_D" index="10"/>
              <signal pad="PD31" function="D" group="ISI_D" index="11"/>
              <signal pad="PD24" function="D" group="ISI_HSYNC"/>
              <signal pad="PA24" function="D" group="ISI_PCK"/>
              <signal pad="PD25" function="D" group="ISI_VSYNC"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="59"/>
              <param name="CLOCK_ID" value="59"/>
            </parameters>
          </instance>
        </module>
        <module name="MATRIX" id="11282" version="L">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x40088000"/>
