Microchip-MPLAB-Harmony/csp/arch/arm/config/devices_cortex_m7/PIC32CZ2038CA70144.atdf
        <register caption="Interrupt Mask Register" name="AES_IMR" offset="0x18" rw="R" size="4" atomic-op="read:AES_IMR">
          <bitfield caption="Data Ready Interrupt Mask" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Interrupt Mask" mask="0x00000100" name="URAD"/>
          <bitfield caption="GCM Tag Ready Interrupt Mask" mask="0x00010000" name="TAGRDY"/>
        </register>
        <register caption="Interrupt Status Register" name="AES_ISR" offset="0x1C" rw="R" size="4" atomic-op="clear:AES_ISR">
          <bitfield caption="Data Ready (cleared by setting bit START or bit SWRST in AES_CR or by reading AES_ODATARx)" mask="0x00000001" name="DATRDY"/>
          <bitfield caption="Unspecified Register Access Detection Status (cleared by writing SWRST in AES_CR)" mask="0x00000100" name="URAD"/>
          <bitfield caption="Unspecified Register Access (cleared by writing SWRST in AES_CR)" mask="0x0000F000" name="URAT" values="AES_ISR__URAT"/>
          <bitfield caption="GCM Tag Ready" mask="0x00010000" name="TAGRDY"/>
        </register>
        <register caption="Key Word Register 0" name="AES_KEYWR" offset="0x20" rw="W" size="4" count="8">
          <bitfield caption="Key Word" mask="0xFFFFFFFF" name="KEYW"/>
        </register>
        <register caption="Input Data Register 0" name="AES_IDATAR" offset="0x40" rw="W" size="4" count="4">
          <bitfield caption="Input Data Word" mask="0xFFFFFFFF" name="IDATA"/>
        </register>
        <register caption="Output Data Register 0" name="AES_ODATAR" offset="0x50" rw="R" size="4" count="4">
          <bitfield caption="Output Data" mask="0xFFFFFFFF" name="ODATA"/>
        </register>
        <register caption="Initialization Vector Register 0" name="AES_IVR" offset="0x60" rw="W" size="4" count="4">
          <bitfield caption="Initialization Vector" mask="0xFFFFFFFF" name="IV"/>
        </register>
        <register caption="Additional Authenticated Data Length Register" name="AES_AADLENR" offset="0x70" rw="RW" size="4">
          <bitfield caption="Additional Authenticated Data Length" mask="0xFFFFFFFF" name="AADLEN"/>
        </register>
        <register caption="Plaintext/Ciphertext Length Register" name="AES_CLENR" offset="0x74" rw="RW" size="4">
          <bitfield caption="Plaintext/Ciphertext Length" mask="0xFFFFFFFF" name="CLEN"/>
        </register>
        <register caption="GCM Intermediate Hash Word Register 0" name="AES_GHASHR" offset="0x78" rw="RW" size="4" count="4">
          <bitfield caption="Intermediate GCM Hash Word x" mask="0xFFFFFFFF" name="GHASH"/>
        </register>
        <register caption="GCM Authentication Tag Word Register 0" name="AES_TAGR" offset="0x88" rw="R" size="4" count="4">
          <bitfield caption="GCM Authentication Tag x" mask="0xFFFFFFFF" name="TAG"/>
        </register>
        <register caption="GCM Encryption Counter Value Register" name="AES_CTRR" offset="0x98" rw="R" size="4">
          <bitfield caption="GCM Encryption Counter" mask="0xFFFFFFFF" name="CTR"/>
        </register>
        <register caption="GCM H Word Register 0" name="AES_GCMHR" offset="0x9C" rw="RW" size="4" count="4">
          <bitfield caption="GCM H Word x" mask="0xFFFFFFFF" name="H"/>
        </register>
      </register-group>
      <value-group caption="" name="AES_MR__DUALBUFF">
        <value caption="AES_IDATARx cannot be written during processing of previous block." name="INACTIVE" value="0"/>
        <value caption="AES_IDATARx can be written during processing of previous block when SMOD = 2. It speeds up the overall runtime of large files." name="ACTIVE" value="1"/>
      </value-group>
      <value-group caption="" name="AES_MR__SMOD">
        <value caption="Manual Mode" name="MANUAL_START" value="0x0"/>
        <value caption="Auto Mode" name="AUTO_START" value="0x1"/>
        <value caption="AES_IDATAR0 access only Auto Mode (DMA)" name="IDATAR0_START" value="0x2"/>
      </value-group>
      <value-group caption="" name="AES_MR__KEYSIZE">
        <value caption="AES Key Size is 128 bits" name="AES128" value="0x0"/>
        <value caption="AES Key Size is 192 bits" name="AES192" value="0x1"/>
        <value caption="AES Key Size is 256 bits" name="AES256" value="0x2"/>
      </value-group>
      <value-group caption="" name="AES_MR__OPMOD">
        <value caption="ECB: Electronic Code Book mode" name="ECB" value="0x0"/>
        <value caption="CBC: Cipher Block Chaining mode" name="CBC" value="0x1"/>
        <value caption="OFB: Output Feedback mode" name="OFB" value="0x2"/>
        <value caption="CFB: Cipher Feedback mode" name="CFB" value="0x3"/>
        <value caption="CTR: Counter mode (16-bit internal counter)" name="CTR" value="0x4"/>
        <value caption="GCM: Galois/Counter mode" name="GCM" value="0x5"/>
      </value-group>
      <value-group caption="" name="AES_MR__CFBS">
        <value caption="128-bit" name="SIZE_128BIT" value="0x0"/>
        <value caption="64-bit" name="SIZE_64BIT" value="0x1"/>
        <value caption="32-bit" name="SIZE_32BIT" value="0x2"/>
        <value caption="16-bit" name="SIZE_16BIT" value="0x3"/>
        <value caption="8-bit" name="SIZE_8BIT" value="0x4"/>
      </value-group>
      <value-group caption="" name="AES_MR__CKEY">
        <value caption="This field must be written with 0xE to allow CMTYPx bit configuration changes. Any other values will abort the write operation in CMTYPx bits.Always reads as 0." name="PASSWD" value="0xE"/>
      </value-group>
      <value-group caption="" name="AES_MR__CMTYP1">
        <value caption="Countermeasure type 1 is disabled." name="NOPROT_EXTKEY" value="0"/>
        <value caption="Countermeasure type 1 is enabled." name="PROT_EXTKEY" value="1"/>
      </value-group>
      <value-group caption="" name="AES_MR__CMTYP2">
        <value caption="Countermeasure type 2 is disabled." name="NO_PAUSE" value="0"/>
        <value caption="Countermeasure type 2 is enabled." name="PAUSE" value="1"/>
      </value-group>
      <value-group caption="" name="AES_MR__CMTYP3">
        <value caption="Countermeasure type 3 is disabled." name="NO_DUMMY" value="0"/>
        <value caption="Countermeasure type 3 is enabled." name="DUMMY" value="1"/>
      </value-group>
      <value-group caption="" name="AES_MR__CMTYP4">
        <value caption="Countermeasure type 4 is disabled." name="NO_RESTART" value="0"/>
        <value caption="Countermeasure type 4 is enabled." name="RESTART" value="1"/>
      </value-group>
