Microchip-MPLAB-Harmony/csp/arch/arm/config/devices_cortex_m7/PIC32CZ2038CA70144.atdf
        <register caption="Pull-up Disable Register" name="PORT_PUDR" offset="0x0060" rw="W" size="4" atomic-op="clear:PORT_PUSR">
          <bitfield caption="Pull-Up Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Pull-Up Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Pull-Up Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Pull-Up Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Pull-Up Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Pull-Up Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Pull-Up Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Pull-Up Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Pull-Up Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Pull-Up Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Pull-Up Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Pull-Up Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Pull-Up Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Pull-Up Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Pull-Up Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Pull-Up Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Pull-Up Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Pull-Up Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Pull-Up Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Pull-Up Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Pull-Up Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Pull-Up Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Pull-Up Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Pull-Up Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Pull-Up Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Pull-Up Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Pull-Up Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Pull-Up Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Pull-Up Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Pull-Up Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Pull-Up Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Pull-Up Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Pull-up Enable Register" name="PORT_PUER" offset="0x0064" rw="W" size="4" atomic-op="set:PORT_PUSR">
          <bitfield caption="Pull-Up Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Pull-Up Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Pull-Up Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Pull-Up Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Pull-Up Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Pull-Up Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Pull-Up Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Pull-Up Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Pull-Up Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Pull-Up Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Pull-Up Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Pull-Up Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Pull-Up Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Pull-Up Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Pull-Up Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Pull-Up Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Pull-Up Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Pull-Up Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Pull-Up Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Pull-Up Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Pull-Up Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Pull-Up Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Pull-Up Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Pull-Up Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Pull-Up Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Pull-Up Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Pull-Up Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Pull-Up Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Pull-Up Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Pull-Up Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Pull-Up Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Pull-Up Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Pad Pull-up Status Register" name="PORT_PUSR" offset="0x0068" rw="R" size="4">
          <bitfield caption="Pull-Up Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Pull-Up Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Pull-Up Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Pull-Up Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Pull-Up Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Pull-Up Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Pull-Up Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Pull-Up Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Pull-Up Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Pull-Up Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Pull-Up Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Pull-Up Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Pull-Up Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Pull-Up Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Pull-Up Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Pull-Up Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Pull-Up Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Pull-Up Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Pull-Up Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Pull-Up Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Pull-Up Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Pull-Up Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Pull-Up Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Pull-Up Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Pull-Up Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Pull-Up Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Pull-Up Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Pull-Up Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Pull-Up Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Pull-Up Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Pull-Up Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Pull-Up Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Peripheral ABCD Select Register 0" name="PORT_ABCDSR" offset="0x70" rw="RW" size="4" count="2">
          <bitfield caption="Peripheral Select" mask="0x00000001" name="P0"/>
          <bitfield caption="Peripheral Select" mask="0x00000002" name="P1"/>
          <bitfield caption="Peripheral Select" mask="0x00000004" name="P2"/>
          <bitfield caption="Peripheral Select" mask="0x00000008" name="P3"/>
          <bitfield caption="Peripheral Select" mask="0x00000010" name="P4"/>
          <bitfield caption="Peripheral Select" mask="0x00000020" name="P5"/>
          <bitfield caption="Peripheral Select" mask="0x00000040" name="P6"/>
          <bitfield caption="Peripheral Select" mask="0x00000080" name="P7"/>
          <bitfield caption="Peripheral Select" mask="0x00000100" name="P8"/>
          <bitfield caption="Peripheral Select" mask="0x00000200" name="P9"/>
          <bitfield caption="Peripheral Select" mask="0x00000400" name="P10"/>
          <bitfield caption="Peripheral Select" mask="0x00000800" name="P11"/>
          <bitfield caption="Peripheral Select" mask="0x00001000" name="P12"/>
          <bitfield caption="Peripheral Select" mask="0x00002000" name="P13"/>
          <bitfield caption="Peripheral Select" mask="0x00004000" name="P14"/>
          <bitfield caption="Peripheral Select" mask="0x00008000" name="P15"/>
          <bitfield caption="Peripheral Select" mask="0x00010000" name="P16"/>
          <bitfield caption="Peripheral Select" mask="0x00020000" name="P17"/>
          <bitfield caption="Peripheral Select" mask="0x00040000" name="P18"/>
          <bitfield caption="Peripheral Select" mask="0x00080000" name="P19"/>
          <bitfield caption="Peripheral Select" mask="0x00100000" name="P20"/>
          <bitfield caption="Peripheral Select" mask="0x00200000" name="P21"/>
          <bitfield caption="Peripheral Select" mask="0x00400000" name="P22"/>
          <bitfield caption="Peripheral Select" mask="0x00800000" name="P23"/>
          <bitfield caption="Peripheral Select" mask="0x01000000" name="P24"/>
          <bitfield caption="Peripheral Select" mask="0x02000000" name="P25"/>
          <bitfield caption="Peripheral Select" mask="0x04000000" name="P26"/>
          <bitfield caption="Peripheral Select" mask="0x08000000" name="P27"/>
          <bitfield caption="Peripheral Select" mask="0x10000000" name="P28"/>
          <bitfield caption="Peripheral Select" mask="0x20000000" name="P29"/>
          <bitfield caption="Peripheral Select" mask="0x40000000" name="P30"/>
          <bitfield caption="Peripheral Select" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Input Filter Slow Clock Disable Register" name="PORT_IFSCDR" offset="0x0080" rw="W" size="4" atomic-op="clear:PORT_IFSCSR">
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00000001" name="P0"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00000002" name="P1"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00000004" name="P2"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00000008" name="P3"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00000010" name="P4"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00000020" name="P5"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00000040" name="P6"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00000080" name="P7"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00000100" name="P8"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00000200" name="P9"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00000400" name="P10"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00000800" name="P11"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00001000" name="P12"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00002000" name="P13"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00004000" name="P14"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00008000" name="P15"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00010000" name="P16"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00020000" name="P17"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00040000" name="P18"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00080000" name="P19"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00100000" name="P20"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00200000" name="P21"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00400000" name="P22"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x00800000" name="P23"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x01000000" name="P24"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x02000000" name="P25"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x04000000" name="P26"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x08000000" name="P27"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x10000000" name="P28"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x20000000" name="P29"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x40000000" name="P30"/>
          <bitfield caption="Peripheral Clock Glitch Filtering Select" mask="0x80000000" name="P31"/>
        </register>
