Microchip-MPLAB-Harmony/csp/arch/arm/config/devices_cortex_m7/PIC32CZ2038CA70144.atdf
      <value-group caption="" name="PORT_DRIVER__LINE1">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE2">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE3">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE4">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE5">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE6">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE7">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE8">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE9">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE10">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE11">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE12">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE13">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE14">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE15">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE16">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE17">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE18">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE19">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE20">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE21">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE22">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE23">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE24">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE25">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE26">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE27">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE28">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE29">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
      <value-group caption="" name="PORT_DRIVER__LINE30">
        <value caption="Lowest drive" name="LOW_DRIVE" value="0"/>
        <value caption="Highest drive" name="HIGH_DRIVE" value="1"/>
      </value-group>
