Microchip-MPLAB-Harmony/csp/arch/arm/config/devices_cortex_m7/PIC32CZ2038CA70144.atdf
        <register caption="Device DMA Channel Address Register (n = 1)" name="USBHS_DEVDMAADDRESS" offset="0x04" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="Device DMA Channel Control Register (n = 1)" name="USBHS_DEVDMACONTROL" offset="0x08" rw="RW" size="4">
          <bitfield caption="Channel Enable Command" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable Command" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable Control (OUT transfers only)" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable Control" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="Device DMA Channel Status Register (n = 1)" name="USBHS_DEVDMASTATUS" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
      </register-group>
      <register-group name="USBHS_HSTDMA" size="16">
        <register caption="Host DMA Channel Next Descriptor Address Register (n = 1)" name="USBHS_HSTDMANXTDSC" offset="0x00" rw="RW" size="4">
          <bitfield caption="Next Descriptor Address" mask="0xFFFFFFFF" name="NXT_DSC_ADD"/>
        </register>
        <register caption="Host DMA Channel Address Register (n = 1)" name="USBHS_HSTDMAADDRESS" offset="0x04" rw="RW" size="4">
          <bitfield caption="Buffer Address" mask="0xFFFFFFFF" name="BUFF_ADD"/>
        </register>
        <register caption="Host DMA Channel Control Register (n = 1)" name="USBHS_HSTDMACONTROL" offset="0x08" rw="RW" size="4">
          <bitfield caption="Channel Enable Command" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Load Next Channel Transfer Descriptor Enable Command" mask="0x00000002" name="LDNXT_DSC"/>
          <bitfield caption="End of Transfer Enable Control (OUT transfers only)" mask="0x00000004" name="END_TR_EN"/>
          <bitfield caption="End of Buffer Enable Control" mask="0x00000008" name="END_B_EN"/>
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000010" name="END_TR_IT"/>
          <bitfield caption="End of Buffer Interrupt Enable" mask="0x00000020" name="END_BUFFIT"/>
          <bitfield caption="Descriptor Loaded Interrupt Enable" mask="0x00000040" name="DESC_LD_IT"/>
          <bitfield caption="Burst Lock Enable" mask="0x00000080" name="BURST_LCK"/>
          <bitfield caption="Buffer Byte Length (Write-only)" mask="0xFFFF0000" name="BUFF_LENGTH"/>
        </register>
        <register caption="Host DMA Channel Status Register (n = 1)" name="USBHS_HSTDMASTATUS" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Channel Enable Status" mask="0x00000001" name="CHANN_ENB"/>
          <bitfield caption="Channel Active Status" mask="0x00000002" name="CHANN_ACT"/>
          <bitfield caption="End of Channel Transfer Status" mask="0x00000010" name="END_TR_ST"/>
          <bitfield caption="End of Channel Buffer Status" mask="0x00000020" name="END_BF_ST"/>
          <bitfield caption="Descriptor Loaded Status" mask="0x00000040" name="DESC_LDST"/>
          <bitfield caption="Buffer Byte Count" mask="0xFFFF0000" name="BUFF_COUNT"/>
        </register>
      </register-group>
      <register-group name="USBHS">
        <register caption="Device General Control Register" name="USBHS_DEVCTRL" offset="0x0000" rw="RW" size="4">
          <bitfield caption="USB Address" mask="0x0000007F" name="UADD"/>
          <bitfield caption="Address Enable" mask="0x00000080" name="ADDEN"/>
          <bitfield caption="Detach" mask="0x00000100" name="DETACH"/>
          <bitfield caption="Remote Wake-Up" mask="0x00000200" name="RMWKUP"/>
          <bitfield caption="Mode Configuration" mask="0x00000C00" name="SPDCONF" values="USBHS_DEVCTRL__SPDCONF"/>
          <bitfield caption="Low-Speed Mode Force" mask="0x00001000" name="LS"/>
          <bitfield caption="Test mode J" mask="0x00002000" name="TSTJ"/>
          <bitfield caption="Test mode K" mask="0x00004000" name="TSTK"/>
          <bitfield caption="Test packet mode" mask="0x00008000" name="TSTPCKT"/>
          <bitfield caption="Specific Operational mode" mask="0x00010000" name="OPMODE2"/>
        </register>
        <register caption="Device Global Interrupt Status Register" name="USBHS_DEVISR" offset="0x0004" rw="R" size="4">
          <bitfield caption="Suspend Interrupt" mask="0x00000001" name="SUSP"/>
          <bitfield caption="Micro Start of Frame Interrupt" mask="0x00000002" name="MSOF"/>
          <bitfield caption="Start of Frame Interrupt" mask="0x00000004" name="SOF"/>
          <bitfield caption="End of Reset Interrupt" mask="0x00000008" name="EORST"/>
          <bitfield caption="Wake-Up Interrupt" mask="0x00000010" name="WAKEUP"/>
          <bitfield caption="End of Resume Interrupt" mask="0x00000020" name="EORSM"/>
          <bitfield caption="Upstream Resume Interrupt" mask="0x00000040" name="UPRSM"/>
          <bitfield caption="Endpoint 0 Interrupt" mask="0x00001000" name="PEP_0"/>
          <bitfield caption="Endpoint 1 Interrupt" mask="0x00002000" name="PEP_1"/>
          <bitfield caption="Endpoint 2 Interrupt" mask="0x00004000" name="PEP_2"/>
          <bitfield caption="Endpoint 3 Interrupt" mask="0x00008000" name="PEP_3"/>
          <bitfield caption="Endpoint 4 Interrupt" mask="0x00010000" name="PEP_4"/>
          <bitfield caption="Endpoint 5 Interrupt" mask="0x00020000" name="PEP_5"/>
          <bitfield caption="Endpoint 6 Interrupt" mask="0x00040000" name="PEP_6"/>
          <bitfield caption="Endpoint 7 Interrupt" mask="0x00080000" name="PEP_7"/>
          <bitfield caption="Endpoint 8 Interrupt" mask="0x00100000" name="PEP_8"/>
          <bitfield caption="Endpoint 9 Interrupt" mask="0x00200000" name="PEP_9"/>
          <bitfield caption="DMA Channel 1 Interrupt" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt" mask="0x40000000" name="DMA_6"/>
          <bitfield caption="DMA Channel 7 Interrupt" mask="0x80000000" name="DMA_7"/>
        </register>
        <register caption="Device Global Interrupt Clear Register" name="USBHS_DEVICR" offset="0x0008" rw="W" size="4" atomic-op="clear:USBHS_DEVISR">
          <bitfield caption="Suspend Interrupt Clear" mask="0x00000001" name="SUSPC"/>
          <bitfield caption="Micro Start of Frame Interrupt Clear" mask="0x00000002" name="MSOFC"/>
          <bitfield caption="Start of Frame Interrupt Clear" mask="0x00000004" name="SOFC"/>
          <bitfield caption="End of Reset Interrupt Clear" mask="0x00000008" name="EORSTC"/>
          <bitfield caption="Wake-Up Interrupt Clear" mask="0x00000010" name="WAKEUPC"/>
          <bitfield caption="End of Resume Interrupt Clear" mask="0x00000020" name="EORSMC"/>
          <bitfield caption="Upstream Resume Interrupt Clear" mask="0x00000040" name="UPRSMC"/>
        </register>
        <register caption="Device Global Interrupt Set Register" name="USBHS_DEVIFR" offset="0x000C" rw="W" size="4" atomic-op="set:USBHS_DEVISR">
          <bitfield caption="Suspend Interrupt Set" mask="0x00000001" name="SUSPS"/>
          <bitfield caption="Micro Start of Frame Interrupt Set" mask="0x00000002" name="MSOFS"/>
          <bitfield caption="Start of Frame Interrupt Set" mask="0x00000004" name="SOFS"/>
          <bitfield caption="End of Reset Interrupt Set" mask="0x00000008" name="EORSTS"/>
          <bitfield caption="Wake-Up Interrupt Set" mask="0x00000010" name="WAKEUPS"/>
          <bitfield caption="End of Resume Interrupt Set" mask="0x00000020" name="EORSMS"/>
          <bitfield caption="Upstream Resume Interrupt Set" mask="0x00000040" name="UPRSMS"/>
          <bitfield caption="DMA Channel 1 Interrupt Set" mask="0x02000000" name="DMA_1"/>
          <bitfield caption="DMA Channel 2 Interrupt Set" mask="0x04000000" name="DMA_2"/>
          <bitfield caption="DMA Channel 3 Interrupt Set" mask="0x08000000" name="DMA_3"/>
          <bitfield caption="DMA Channel 4 Interrupt Set" mask="0x10000000" name="DMA_4"/>
          <bitfield caption="DMA Channel 5 Interrupt Set" mask="0x20000000" name="DMA_5"/>
          <bitfield caption="DMA Channel 6 Interrupt Set" mask="0x40000000" name="DMA_6"/>
          <bitfield caption="DMA Channel 7 Interrupt Set" mask="0x80000000" name="DMA_7"/>
        </register>
