Microchip-MPLAB-Harmony/csp/arch/arm/config/devices_cortex_m7/PIC32CZ2038CA70144.atdf
        <register caption="Host Pipe Status Register" name="USBHS_HSTPIPISR" offset="0x530" rw="R" size="4" count="10">
          <mode name="CTRL_BULK_INT" qualifier="USBHS_HSTPIPCFG.PTYPE" caption="Control, Interrupt and Bulk Endpoints"/>
          <mode name="INT_ISO" qualifier="USBHS_HSTPIPCFG.PTYPE" caption="Interrupt and Isochronous Endpoints"/>
          <mode name="ISOCHRONOUS" qualifier="USBHS_HSTPIPCFG.PTYPE" value="0x1" caption="Isochronous Endpoints"/>
          <bitfield caption="Received IN Data Interrupt" mask="0x00000001" name="RXINI"/>
          <bitfield caption="Transmitted OUT Data Interrupt" mask="0x00000002" name="TXOUTI"/>
          <bitfield caption="Transmitted SETUP Interrupt" mask="0x00000004" name="TXSTPI"/>
          <bitfield modes="INT_ISO" caption="Underflow Interrupt" mask="0x00000004" name="UNDERFI"/>
          <bitfield caption="Pipe Error Interrupt" mask="0x00000008" name="PERRI"/>
          <bitfield caption="NAKed Interrupt" mask="0x00000010" name="NAKEDI"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFI"/>
          <bitfield modes="CTRL_BULK_INT" caption="Received STALLed Interrupt" mask="0x00000040" name="RXSTALLDI"/>
          <bitfield modes="ISOCHRONOUS" caption="CRC Error Interrupt" mask="0x00000040" name="CRCERRI"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETI"/>
          <bitfield caption="Data Toggle Sequence" mask="0x00000300" name="DTSEQ" values="USBHS_HSTPIPISR__DTSEQ"/>
          <bitfield caption="Number of Busy Banks" mask="0x00003000" name="NBUSYBK" values="USBHS_HSTPIPISR__NBUSYBK"/>
          <bitfield caption="Current Bank" mask="0x0000C000" name="CURRBK" values="USBHS_HSTPIPISR__CURRBK"/>
          <bitfield caption="Read/Write Allowed" mask="0x00010000" name="RWALL"/>
          <bitfield caption="Configuration OK Status" mask="0x00040000" name="CFGOK"/>
          <bitfield caption="Pipe Byte Count" mask="0x7FF00000" name="PBYCT"/>
        </register>
        <register caption="Host Pipe Clear Register" name="USBHS_HSTPIPICR" offset="0x560" rw="W" size="4" count="10" atomic-op="clear:USBHS_HSTPIPISR">
          <mode name="CTRL_BULK_INT" qualifier="USBHS_HSTPIPCFG.PTYPE" caption="Control, Interrupt and Bulk Endpoints"/>
          <mode name="INT_ISO" qualifier="USBHS_HSTPIPCFG.PTYPE" caption="Interrupt and Isochronous Endpoints"/>
          <mode name="ISOCHRONOUS" qualifier="USBHS_HSTPIPCFG.PTYPE" value="0x1" caption="Isochronous Endpoints"/>
          <bitfield caption="Received IN Data Interrupt Clear" mask="0x00000001" name="RXINIC"/>
          <bitfield caption="Transmitted OUT Data Interrupt Clear" mask="0x00000002" name="TXOUTIC"/>
          <bitfield caption="Transmitted SETUP Interrupt Clear" mask="0x00000004" name="TXSTPIC"/>
          <bitfield modes="INT_ISO" caption="Underflow Interrupt Clear" mask="0x00000004" name="UNDERFIC"/>
          <bitfield caption="NAKed Interrupt Clear" mask="0x00000010" name="NAKEDIC"/>
          <bitfield caption="Overflow Interrupt Clear" mask="0x00000020" name="OVERFIC"/>
          <bitfield modes="CTRL_BULK_INT" caption="Received STALLed Interrupt Clear" mask="0x00000040" name="RXSTALLDIC"/>
          <bitfield modes="ISOCHRONOUS" caption="CRC Error Interrupt Clear" mask="0x00000040" name="CRCERRIC"/>
          <bitfield caption="Short Packet Interrupt Clear" mask="0x00000080" name="SHORTPACKETIC"/>
        </register>
        <register caption="Host Pipe Set Register" name="USBHS_HSTPIPIFR" offset="0x590" rw="W" size="4" count="10" atomic-op="set:USBHS_HSTPIPISR">
          <mode name="CTRL_BULK_INT" qualifier="USBHS_HSTPIPCFG.PTYPE" caption="Control, Interrupt and Bulk Endpoints"/>
          <mode name="INT_ISO" qualifier="USBHS_HSTPIPCFG.PTYPE" caption="Interrupt and Isochronous Endpoints"/>
          <mode name="ISOCHRONOUS" qualifier="USBHS_HSTPIPCFG.PTYPE" value="0x1" caption="Isochronous Endpoints"/>
          <bitfield caption="Received IN Data Interrupt Set" mask="0x00000001" name="RXINIS"/>
          <bitfield caption="Transmitted OUT Data Interrupt Set" mask="0x00000002" name="TXOUTIS"/>
          <bitfield caption="Transmitted SETUP Interrupt Set" mask="0x00000004" name="TXSTPIS"/>
          <bitfield modes="INT_ISO" caption="Underflow Interrupt Set" mask="0x00000004" name="UNDERFIS"/>
          <bitfield caption="Pipe Error Interrupt Set" mask="0x00000008" name="PERRIS"/>
          <bitfield caption="NAKed Interrupt Set" mask="0x00000010" name="NAKEDIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield modes="CTRL_BULK_INT" caption="Received STALLed Interrupt Set" mask="0x00000040" name="RXSTALLDIS"/>
          <bitfield modes="ISOCHRONOUS" caption="CRC Error Interrupt Set" mask="0x00000040" name="CRCERRIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETIS"/>
          <bitfield caption="Number of Busy Banks Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Host Pipe Mask Register" name="USBHS_HSTPIPIMR" offset="0x5C0" rw="R" size="4" count="10">
          <mode name="CTRL_BULK_INT" qualifier="USBHS_HSTPIPCFG.PTYPE" caption="Control, Interrupt and Bulk Endpoints"/>
          <mode name="INT_ISO" qualifier="USBHS_HSTPIPCFG.PTYPE" caption="Interrupt and Isochronous Endpoints"/>
          <mode name="ISOCHRONOUS" qualifier="USBHS_HSTPIPCFG.PTYPE" value="0x1" caption="Isochronous Endpoints"/>
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINE"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTE"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPE"/>
          <bitfield modes="INT_ISO" caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFIE"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRE"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDE"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIE"/>
          <bitfield modes="CTRL_BULK_INT" caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDE"/>
          <bitfield modes="ISOCHRONOUS" caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRE"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIE"/>
          <bitfield caption="Number of Busy Banks Interrupt Enable" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMA"/>
          <bitfield caption="Pipe Freeze" mask="0x00020000" name="PFREEZE"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
        </register>
        <register caption="Host Pipe Enable Register" name="USBHS_HSTPIPIER" offset="0x5F0" rw="W" size="4" count="10" atomic-op="set:USBHS_HSTPIPIMR">
          <mode name="CTRL_BULK_INT" qualifier="USBHS_HSTPIPCFG.PTYPE" caption="Control, Interrupt and Bulk Endpoints"/>
          <mode name="INT_ISO" qualifier="USBHS_HSTPIPCFG.PTYPE" caption="Interrupt and Isochronous Endpoints"/>
          <mode name="ISOCHRONOUS" qualifier="USBHS_HSTPIPCFG.PTYPE" value="0x1" caption="Isochronous Endpoints"/>
          <bitfield caption="Received IN Data Interrupt Enable" mask="0x00000001" name="RXINES"/>
          <bitfield caption="Transmitted OUT Data Interrupt Enable" mask="0x00000002" name="TXOUTES"/>
          <bitfield caption="Transmitted SETUP Interrupt Enable" mask="0x00000004" name="TXSTPES"/>
          <bitfield modes="INT_ISO" caption="Underflow Interrupt Enable" mask="0x00000004" name="UNDERFIES"/>
          <bitfield caption="Pipe Error Interrupt Enable" mask="0x00000008" name="PERRES"/>
          <bitfield caption="NAKed Interrupt Enable" mask="0x00000010" name="NAKEDES"/>
          <bitfield caption="Overflow Interrupt Enable" mask="0x00000020" name="OVERFIES"/>
          <bitfield modes="CTRL_BULK_INT" caption="Received STALLed Interrupt Enable" mask="0x00000040" name="RXSTALLDES"/>
          <bitfield modes="ISOCHRONOUS" caption="CRC Error Interrupt Enable" mask="0x00000040" name="CRCERRES"/>
          <bitfield caption="Short Packet Interrupt Enable" mask="0x00000080" name="SHORTPACKETIES"/>
          <bitfield caption="Number of Busy Banks Enable" mask="0x00001000" name="NBUSYBKES"/>
          <bitfield caption="Pipe Interrupts Disable HDMA Request Enable" mask="0x00010000" name="PDISHDMAS"/>
          <bitfield caption="Pipe Freeze Enable" mask="0x00020000" name="PFREEZES"/>
          <bitfield caption="Reset Data Toggle Enable" mask="0x00040000" name="RSTDTS"/>
        </register>
